# PowerFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..PowerFactor Property
AreaBasedLoadData Class See Also
---
The power factor of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double PowerFactor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PowerFactor As Double
	Get
```

Visual C++
---
```text
public:
property double PowerFactor {
	double get ();
}
```

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace